Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

№1

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('ml-25m/movies.csv')
data.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [3]:
data1 =pd.read_csv('ml-25m/ratings.csv')
data1.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [4]:
joined = data1.merge(data, on='movieId', how='left')
joined.head()

,userId,movieId,rating,timestamp,title,genres
0,1,296,5.0,1147880044,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
1,1,306,3.5,1147868817,Three Colors: Red (Trois couleurs: Rouge) (1994),Drama
2,1,307,5.0,1147868828,Three Colors: Blue (Trois couleurs: Bleu) (1993),Drama
3,1,665,5.0,1147878820,Underground (1995),Comedy|Drama|War
4,1,899,3.5,1147868510,Singin' in the Rain (1952),Comedy|Musical|Romance

In [37]:
max_rating = data1['rating'].max()
max_rating

5.0

In [108]:
#1 вариант возврата данных
new_data = joined[ joined.rating == max_rating ]
new_data['movieId'].value_counts().head(1)

318    39553
Name: movieId, dtype: int64

In [93]:
#2 вариант возврата данных
new_data = joined[ joined.rating == max_rating ]
new_data['title'].value_counts().head(1)

Shawshank Redemption, The (1994)    39553
Name: title, dtype: int64

№2

In [6]:
data_power = pd.read_csv('part education/power.csv')
data_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [18]:
#фильтр по странам и категориям
filter_countries = data_power[((data_power['country'] == 'Latvia') | (data_power['country']=='Lithuania') | (data_power['country']=='Estonia'))&((data_power['category'] == 4) | (data_power['category'] == 12)| (data_power['category'] == 21))]

#фильтр по нужным значениям лет
filter_years = filter_countries[(filter_countries['year'] > 2004) & (filter_countries['year'] < 2011) & filter_countries['quantity'] > 0]

#суммарное количество потребления энергии, по странам Прибалтики 
summ=filter_years[filter_years.country.str.contains('|'.join(['Lat','Lit','Est']))]['quantity'].sum()
print('Суммарное количество потребления энергии: {}'.format(summ))

Суммарное количество потребления энергии: 240481.0

№3

In [26]:
pd.read_html('https://fortrader.org/quotes')[0]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  91.81      -0.03         -0.03        NaN
1       USDRUB Курс рубля к доллару  77.33       0.28          0.36        NaN